Revit 2026 API

# Location Properties

---

The Location type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

#### Reference

Location Class

Autodesk.Revit.DB Namespace